wisteria-1c/Конфигурация/Documents/ДокументРасчетовСКонтрагентом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ДокументРасчетовСКонтрагентом</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетовСКомитентом</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

wisteria-1c/Конфигурация/Documents/ДокументРасчетовСКонтрагентом/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды	
	ЭтоВариантИнтерфейса85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();	
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	Если Не ЭтоВариантИнтерфейса85 Тогда
		ПараметрыРазмещения.КоманднаяПанель = КоманднаяПанель;
	КонецЕсли;

	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		// По документам сформированным вводом начальных остатков по НДС не допускаются изменения
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Договор = Неопределено;
	Параметры.ЗначенияЗаполнения.Свойство("Договор", Договор);
	Объект.ДоговорКонтрагента = Договор;
	
	УправлениеФормой(ЭтотОбъект);
	
	АдаптацияТакси();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		ДанныеОбъекта = Новый Структура;
		ДанныеОбъекта.Вставить("Ссылка");
		ДанныеОбъекта.Вставить("Организация");
		ДанныеОбъекта.Вставить("Контрагент");
		ДанныеОбъекта.Вставить("ДоговорКонтрагента");
		ДанныеОбъекта.Вставить("ВалютаДокумента");
		
		ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
		
		УстановитьДоговорКонтрагента(ДанныеОбъекта);
		
		Объект.ДоговорКонтрагента = ДанныеОбъекта.ДоговорКонтрагента;
		Объект.ВалютаДокумента    = ДанныеОбъекта.ВалютаДокумента;
		
	Иначе
		
		Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
			Объект.ДоговорКонтрагента = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
		КонецЕсли;	
		
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ДатаВходящегоДокументаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаВходящегоДокумента) И НЕ Объект.Проведен Тогда
		Объект.Дата = Объект.ДатаВходящегоДокумента + (Объект.Дата - НачалоДня(Объект.Дата));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		ДанныеОбъекта = Новый Структура;
		ДанныеОбъекта.Вставить("Ссылка");
		ДанныеОбъекта.Вставить("Организация");
		ДанныеОбъекта.Вставить("Контрагент");
		ДанныеОбъекта.Вставить("ДоговорКонтрагента");
		ДанныеОбъекта.Вставить("ВалютаДокумента");
		
		ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
		
		УстановитьДоговорКонтрагента(ДанныеОбъекта);
		
		Объект.ДоговорКонтрагента = ДанныеОбъекта.ДоговорКонтрагента;
		Объект.ВалютаДокумента    = ДанныеОбъекта.ВалютаДокумента;
		
	Иначе
		
		Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
			Объект.ДоговорКонтрагента = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
		КонецЕсли;	
		
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		ДоговорКонтрагентаПриИзмененииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомментарийИзменить(Команда)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
	Объект.Комментарий, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДоговорКонтрагентаПриИзмененииНаСервере()

	Объект.ВалютаДокумента = ПолучитьВалютуДоговора(Объект.ДоговорКонтрагента);
		
    ВестиРасчетыПоДоговорам =
        ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "ВестиРасчетыПоДоговорам") = Истина;
	Если ВестиРасчетыПоДоговорам Тогда
		Возврат;
	КонецЕсли;
	
	// Если не ведется учет по договорам и заполнен договор, 
	// то по реквизитам этого договора ищем основной договор
	// Если находим, то заменяем выбранный договор на основной. Учет ведется только по основным договорам.
	// В случае если не находим, то ничего не делаем, при записи документа этот договор установится как основной. 
	
	// Проверим является ли выбранный договор основным
	СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДоговорКонтрагента,
		"Организация, Владелец, ВидДоговора");
	
	ОсновнойДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
//	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(
//		ОсновнойДоговор, 
//		СтруктураРеквизитов.Владелец,
//		СтруктураРеквизитов.Организация,
//		СтруктураРеквизитов.ВидДоговора);
	ЭтотОбъект.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПоДокументуКонтрагентуОрганизацииИВидуОперации(
		ЭтотОбъект, СтруктураРеквизитов.Владелец, СтруктураРеквизитов.Организация);
			
	Если ЗначениеЗаполнено(ОсновнойДоговор) И ОсновнойДоговор <> Объект.ДоговорКонтрагента Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Для расчетов с контрагентом %1 используется %2.'"),
			СтруктураРеквизитов.Владелец, ОсновнойДоговор);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,, "ДоговорКонтрагента");
		Объект.ДоговорКонтрагента = ОсновнойДоговор;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНасервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект = Форма.Объект;
	
	Элементы = Форма.Элементы;
	
	Элементы.ДоговорКонтрагента.Доступность = ЗначениеЗаполнено(Объект.Организация)
		И ЗначениеЗаполнено(Объект.Контрагент);
	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура УстановитьДоговорКонтрагента(ДанныеОбъекта)

	ДанныеОбъекта.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПоДокументуКонтрагентуОрганизацииИВидуОперации(ДанныеОбъекта.Ссылка, ДанныеОбъекта.Контрагент, ДанныеОбъекта.Организация);
	ДанныеОбъекта.ВалютаДокумента = ПолучитьВалютуДоговора(ДанныеОбъекта.ДоговорКонтрагента);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВалютуДоговора(ДоговорКонтрагента)
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, "ВалютаРасчетов");
	Иначе
		Возврат Константы.НациональнаяВалюта.Получить();
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура АдаптацияТакси()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Комментарий.КнопкаВыбора = Истина;
	
КонецПроцедуры

#КонецОбласти
